Repository: minanader11/04academy_task
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: success
ar: النجاح

source: error
ar: خطأ

# errorButton
source: Ok
ar: حسنا

source: No DataFound
ar: لا يوجد بيانات

source: required
ar: مطلوب

source: Password Required
ar: كلمة السر مطلوبة

source: Invalid Password
ar: كلمة سر خطأ

source: emailRequired
ar: الايميل مطلوب

source: invalidEmail
ar: الرجاء إدخال البريد الالكتروني بالشكل الصحيح

# fillRequired
source: Required
ar: مطلوب

source: Sign In
ar: تسجيل دخول

source: Login Done
ar: تم تسجيل الدخول

source: registerDone
ar: تم انشاء الحساب بنجاح

source: logout
ar: تسجيل الخروج

# exit
source: Are you sure to log out?
ar: هل أنت متأكد من تسجيل الخروج ؟

source: yes
ar: نعم

source: no
ar: لا

# welcome
source: Welcome back
ar: مرحبا بعودتك

source: Choose Train
ar: اختـار قــطارك

# isReq
source: Is Required
ar: مطلوب

# mobVal
source: Check mobile
ar: تأكد من رقم الهاتف

# passCheck
source: Check Password
ar: تأكد من كلمة

source: Ok
ar: موافقة

source: Wait
ar: انتظر

source: Reserve Ticket
ar: حجــز التــذكرة

source: Train Info
ar: معلومات القطــار

source: Ticket Count
ar: عدد التذاكر

# searchTicket
source: Ticket Search
ar: ابحــث عن تذكــرة

source: From
ar: من

source: Travel From
ar: السفر من

source: To
ar: الي

source: Travel To
ar: السفر الي

source: Reservation Date
ar: تاريخ الحجز

source: Reserve
ar: حجـــز / صــرف

# travelClass
source: Ticket Class
ar: درجة السفر

source: Traveling From
ar: السفر من

source: traveling To
ar: السفر الي

source: Travel
ar: السفر

source: Find Your Station
ar: دور على محطتك

source: Where Do You Want To Go?
ar: عايز تروح فين؟

# emailAddress
source: Email
ar: البريد الالكترونى

source: Password
ar: كلمة السر

# confPassword
source: Confirm Password
ar: تأكيد كلمة السر

source: forgetPassword?
ar: نسيت كلمة السر؟

source: don't Have An Account?
ar: لا تملك حساب؟

source: Register Now
ar: سجل الان

# reservation
source: Reserve
ar: أحجــــــــــــز

source: Your Ticket
ar: تــــــذكرتك

source: Passenger
ar: الراكب

source: Passenger name
ar: اسم الراكب

# isPerson
source: The traveler is the account holder
ar: المسافر هو صاحب الحساب

# yourName
source: Full Name
ar: الاسم بالكامل

source: National Type
ar: نوع البطاقة

source: National Id
ar: رقم البطاقة

source: Payment Option
ar: طريــقة الدفــع

# changePayment
source: Change payment method
ar: تغير طريقه الدفع

source: Wallet
ar: مـــحفظتــنا

source: Bill
ar: الفاتـــورة

source: Code
ar: كــود خــصم

source: Price
ar: السعر

# service
source: Services
ar: رسوم الخدمة

source: Total
ar: الاجمالي

source: Travel Info
ar: تعليمات السفر

# travelInfoText
source: The main passenger with the national number registered on the ticket must be present on the train Travel time, if you wish to refund your ticket, it will be through the ticket windows At the stations
ar: يجب تواجد الراكب الرئيسى صاحب الرقم القومى المسجل بالتذكرة بالقطار وقت السفر,فى حالة الرغبة فى رد التذكرة يكون من خلال شبابيك التذاكر بالمحطات

source: Confirm Reservation
ar: تأكيد الحجز

source: Account Settings
ar: اعدادات الحســـاب

source: Edit Account
ar: تعديل الحســـاب

# openNoti
source: open Notification
ar: تشغيل الاشعارات

source: More
ar: المزيد

source: Change Language
ar: تغيير اللغه

source: Suggestions And Complaints
ar: المقترحات والشكاوى

source: Contact Us
ar: تواصل معنا

source: Instructions
ar: التعليمات

source: Cancel
ar: إلغاء

source: Hello,
ar: اهلا,

source: Once Again
ar: مرة اخرى

source: Register Your Account
ar: سجل حسابك

source: With Us Now
ar: معنا الان

source: First Name
ar: الاسم الاول

source: Last Name
ar: الاسم الأخير

# nationalIdNumber
source: National Id
ar: الرقم القومى

source: Next
ar: التالي

source: I Already Have An Account
ar: املك حساب بالفعل

source: Phone Number
ar: رقم الهاتف

source: userName
ar: اسم المستخدم

# electronicTicket
source: The Electronic Ticket
ar: التذكرة الإلكترونية

source: Scan The Code
ar: قم بمسح الرمز

source: Air conditioning - first class
ar: المكيــــف - الدرجه الاولى

source: Ticket Number
ar: رقم التذكرة

source: ID Number
ar: رقم الهوية

source: A seat
ar: مقعد

source: TrainNumber
ar: رقم القطار

source: Cancel Ticket
ar: الغاء الحجز

source: Re-charge
ar: اعــاده الشحن

source: Pay Method
ar: طريقة الدفع

source: Bank Cards
ar: كروت بنكيه

source: Our Wallet
ar: محفظتنا

source: Fawry Pay
ar: فورى باى

source: Notification
ar: الأشعارات

source: Security Updates
ar: تحديثات امنية!

source: The Credit Card Is Connected
ar: بطاقة الائتمان متصلة

source: The Account Has Been Set Up Successfully!
ar: تم إعداد الحساب بنجاح!

# egr
source: Now EGR has two-factor authentication feature, try it,
ar: الآن لدى EGR ميزة المصادقة الثنائية، جربها

# egr2
source: now to make your account more secure.
ar: الآن لجعل حسابك أكثر أمانًا.

# creditCardSuccessfullyLinked
source: Your credit card has been successfully linked
ar: لقد تم ربط بطاقتك الائتمانية بنجاح

# enjoyOurServices
source: EGR, enjoy our services.
ar: EGR، استمتع بخدماتنا.

# accountCreatedSuccessfully
source: Your account has been created successfully
ar: تم إنشاء حسابك بنجاح.

# nowTryOurServices
source: You can now try our services.
ar: تستطيع الآن تجربة خدماتنا.

source: Today
ar: اليوم

source: Charge Wallet
ar: شحن المحفظة

source: Charge .Details
ar: تفاصيل الشحن

source: Choose Payment Type
ar: اختر طريقة دفع مناسبة

# neww
source: New
ar: جديد

source: Write Your Suggestions
ar: اكتب مقترحاتك

source: Send
ar: ارسل

# ComplaintSent
source: Your Complaint has been sent
ar: لقد تم إرسال شكواك

source: Trip Duration
ar: زمن الرحلة

# fillData
source: Please fill data
ar: برجاء ملئ البيانات

# rechargeBalanceAmount
source: Recharge your balance with the amount you want
ar: اشحن رصيدك بالمبلغ الذي تريده

source: Shipped via code
ar: تم الشحن عن طريق كود

# ticketPurchased
source: A ticket has been purchased
ar: تم شراء تذكرة

# forgot
source: I forgot
ar: لقد نسيت

source: Done
ar: تم

# enterCode
source: Enter The Code
ar: ادخل الكود

source: Charge Now
ar: اشحن دلوقتى

# enterAmount
source: Enter The Amount
ar: ادخل المبلغ

# enterCredit
source: Enter The Credit
ar: ادخل الرصيد

source: Add Credit Card
ar: اضف كارت الائتمان

# minimumAmountPounds
source: The minimum amount is 10 pounds
ar: الحد الادنى للمبلغ ١٠ جنيه

# codeCheck
source: Enter Code
ar: ادخل الكود للفحص

source: comsri
ar: يتم الحصول عليها من الكمساري

# codeCheckOnly
source: Code Check
ar: كود الفحص

source: My Trips
ar: رحلاتي

# addYourAdd
source: Post your ad here!
ar: ضع اعلانك هنا !

source: Start Time
ar: وقت القيام

source: End Time
ar: وقت الوصول

# refundText
source: Ticktes Refund
ar: رد التذاكر

# refundInfo
source: The possibility of refunding tickets at a later time, with a service of 5 pounds per ticket
ar: امكانية رد التذاكر في وقت لاحق مع وجود خدمة ٥ جنية للتذكرة

# statue
source: Status
ar: الحالة

source: Seat Number
ar: رقم المقعد

source: New Registration
ar: تسجيل جديد

source: Student
ar: طالب

source: Parent
ar: ولي امر

source: Do You Have Account?
ar: هل لديك حساب؟

# areYou
source: Are you a student seeking to expand your horizons and open the doors of knowledge? A parent who would like to follow your sonâ€™s educational journey and support him in discovering his passion
ar: هل انت طالب تسعي لتوسيع افاقك و فتح ابواب المعرفة؟ ام ولي امر تود متابعة رحلة ابنك التعليمية و دعمه في اكتشاف شغفه

# selectUserType
source: Please Select Your Type
ar: برجاء تحديد نوع المستخدم

# loginBy
source: OR Login With
ar: او تسجيل دخول باستخدام

# weAreHere
source: We are here to help you in your educational journey. Confidently fill out your contact information so we can guide you step by step
ar: نحن هنا لمساعدتك في رحلتك التعليمية . املا بكل ثقة بيانات الاتصال الخاصة بك لنتمكن من توجيهك خطوة خطوة

source: Birth Date
ar: تاريخ الميلاد

source: Gender
ar: الجنس

source: Nationality
ar: الجنسية

# doYouFace
source: Do you face any problems in studying
ar: هل تواجه اي صعوبات في الدراسة

# chooseYourLevel
source: Choose the level of study that suits you and you will be guaranteed the best educational options available
ar: اختر المرحلة الدراسية التي تناسبك و ستضمن لك افضل الخيارات التعليمية المتاحة

# chooseTheStudySubjects
source: Choose the study subjects that suit you and you will be guaranteed the best learning options available
ar: اختر المواد الدراسية التي تناسبك و ستضمن لك افضل الخيارات التعلمية المتاحة

# selectTheTime
source: Select the appropriate time period for you and we will organize the classes according to your schedule
ar: حدد الفترة الزمنية المناسبة لك و سننظم الحصص وفقا لجدولك الزمني
